# format

In [1]:
import mysql.connector as sql
import pandas as pd

mydb = sql.connect (
    host = "localhost",
    user = "root",
    password = "ZAQs8271911c$",
    auth_plugin='mysql_native_password',
    buffered = True,        
    database = "sql_fr_ai"
)



# change it to 2 decimal place
sql_query ="""
select format(8888.12345, 2);
;
"""


df = pd.read_sql_query(
    sql_query,
    mydb)


df

  format(8888.12345, 2)
0              8,888.12

In [4]:
# mysql
# change it to  no decimal place

mysql_query ="""
SELECT FORMAT(1000.123456,0);
;
"""


df = pd.read_sql_query(
    mysql_query,
    mydb)


df

  FORMAT(1000.123456,0)
0                 1,000

In [10]:
# mysql
# change it to  no decimal place

mysql_query ="""
SELECT CONCAT('$', FORMAT(1234.5678, 2));
;
"""


df = pd.read_sql_query(
    mysql_query,
    mydb)


df

  CONCAT('$', FORMAT(1234.5678, 2))
0                         $1,234.57